Autodesk.Revit.DB.Electrical.ElectricalSystem.CableSize
The Cable Size of the Electrical System.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a Cable Size id nor invalidElementId.
-or-
When setting this property: The Cable Size can not be used by the current Cable Type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.ElectricalSystem.CableType
The Cable Type of the Electrical System.
Remarks:
After Cable Type of the Electrical System changes, the Cable Size will be set to InvalidElementId after regeneration.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a Cable Type id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.ElectricalSystem.OtherConductorsNumber
The OtherConductors Number of the Electrical System.
Remarks:
This property is used to retrieve the OtherConductors Number of the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2026

Autodesk.Revit.DB.Electrical.ElectricalSystem.OtherConductorSize
The size of an Other Conductor in the Electrical System.
Remarks:
Each Other Conductor has the same size in the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2026

Autodesk.Revit.DB.Electrical.ElectricalSystem.NeutralConductorSize
The size of a Neutral Conductor in the Electrical System.
Remarks:
Each Neutral Conductor has the same size in the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2026

Autodesk.Revit.DB.Electrical.ElectricalSystem.GroundConductorSize
The size of a Ground Conductor in the Electrical System.
Remarks:
Each Ground Conductor has the same size in the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2026

Autodesk.Revit.DB.Electrical.ElectricalSystem.HotConductorSize
The size of a Hot Conductor in the Electrical System.
Remarks:
Each Hot Conductor has the same size in the Electrical System.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This property only available when System Type is Power!
Since:
2026